Tekla Open API Reference for Tekla Structures 2025
View Properties
The View type exposes the following members.
Properties
Name | Description
CurrentRepresentation
 Gets or sets the current representation.
DisplayCoordinateSystem
The local coordinate system for the display.
DisplayType
The display plane type.
Identifier
The view identifier.
Name
The name of the view. 84 characters at most.
SharedView
 The property which tells if the view is shared. The value is meaningful only when the model is shared.
ViewCoordinateSystem
 The local coordinate system for the view. Can be set when creating a view. The origin is always set to zero.
ViewDepthDown
The view depth down.
ViewDepthUp
The view depth up.
ViewFilter
The name of the view filter. 256 characters at most.
ViewProjection
The view projection type.
ViewRendering
The view rendering type.
VisibilitySettings
 The property which tells the view visibility settings for objects.
WorkArea
The view working area.
Top
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace